Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: To use Flyway on a datasource you otherwise access reactively, simply make sure to configure that datasource both as xref:datasource.adoc#jdbc-datasource[JDBC] and xref:datasource.adoc#reactive-datasource[reactive]. This involves in particular adding dependencies to Quarkus extensions for both the JDBC driver and the reactive client, for instance `quarkus-jdbc-postgresql` *and* `quarkus-reactive-pg-client`.
ja_jp: リアクティブにアクセスするデータソースでFlywayを使用するには、 そのデータソースを xref:datasource.adoc#jdbc-datasource[JDBC] と xref:datasource.adoc#reactive-datasource[リアクティブ] の両方に設定します。 これには特に、JDBCドライバとリアクティブクライアントの両方について、Quarkusのエクステンション、たとえば `quarkus-jdbc-postgresql` *と* `quarkus-reactive-pg-client` に依存関係を追加する必要があります。

source: To use GraalVM CE instead of Mandrel, update the `FROM` clause to: `FROM quay.io/quarkus/ubi-quarkus-graalvmce-builder-image:{graalvm-flavor} AS build`.
ja_jp: Mandrel の代わりに GraalVM CE を使用するには、 `FROM` 句を `FROM quay.io/quarkus/ubi-quarkus-graalvmce-builder-image:{graalvm-flavor} AS build` に更新します。

source: To use GraalVM CE instead of Mandrel, update the `FROM` clause to: `FROM quay.io/quarkus/ubi9-quarkus-graalvmce-builder-image:{graalvm-flavor} AS build`.
ja_jp: Mandrel の代わりに GraalVM CE を使用するには、 `FROM` 節を更新してください： `FROM quay.io/quarkus/ubi9-quarkus-graalvmce-builder-image:{graalvm-flavor} AS build` .

source: To use Hibernate Spatial, you simply need to add the dependency to your project:
ja_jp: Hibernate Spatial を使用するには、単にプロジェクトに依存関係を追加するだけです。

source: To use JFR add the application property: `-Dquarkus.native.enable-vm-inspection=true`. E.g.
ja_jp: JFRを使用するには、アプリケーションのプロパティ `-Dquarkus.native.enable-vm-inspection=true` を追加します。例:

source: To use Mandrel instead of GraalVM CE, update the `FROM` clause to: `FROM quay.io/quarkus/ubi-quarkus-mandrel-builder-image-builder-image:{mandrel-flavor} AS build`.
ja_jp: GraalVM CEの代わりにMandrelを使用するには、 `FROM` 句を更新してください： `FROM quay.io/quarkus/ubi-quarkus-mandrel-builder-image-builder-image:{mandrel-flavor} AS build` .

source: To use Mandrel instead of GraalVM CE, update the `FROM` clause to: `FROM quay.io/quarkus/ubi-quarkus-mandrel-builder-image:{mandrel-flavor} AS build`.
ja_jp: GraalVM CE の代わりに Mandrel を使用するには、 `FROM` 句を `FROM quay.io/quarkus/ubi-quarkus-mandrel:$TAG AS build` に更新します。

source: To use Mandrel instead of GraalVM CE, update the `FROM` clause to: `FROM quay.io/quarkus/ubi-quarkus-mandrel:$TAG AS build`. `$TAG` can be found on the https://quay.io/repository/quarkus/ubi-quarkus-mandrel?tab=tags[Quarkus Mandrel Images Tags page].
ja_jp: GraalVM CE の代わりに Mandrel を使用するには、 `FROM` 句を `FROM quay.io/quarkus/ubi-quarkus-mandrel:$TAG AS build` に更新します。 `$TAG` は、 https://quay.io/repository/quarkus/ubi-quarkus-mandrel?tab=tags[Quarkus Mandrel イメージタグのページ] にあります。

source: To use Redis as a cache backend, refer to the xref:cache-redis-reference.adoc[Redis Cache Backend reference].
ja_jp: Redisをキャッシュバックエンドとして使用するには、 xref:cache-redis-reference.adoc[Redisキャッシュバックエンドのリファレンス] を参照してください。

source: To use Servlet you need to explicitly include `quarkus-undertow`:
ja_jp: サーブレットを使用するには、明示的に `quarkus-undertow` を含める必要があります。

source: To use Servlets in your applications you need to have a Servlet Container such as http://undertow.io[Undertow]. Luckily, `quarkus-bom` imported by our parent `pom.xml` already includes the Undertow Quarkus extension.
ja_jp: アプリケーションでサーブレットを使用するには、 link:http://undertow.io[Undertow] のようなサーブレットコンテナーが必要です。幸い、 `pom.xml` にインポートされる `quarkus-bom` には、すでに Undertow Quarkus エクステンションが含まれています。

source: To use Servlets in your applications you need to have a Servlet Container such as https://undertow.io[Undertow]. Luckily, `quarkus-bom` imported by our parent `pom.xml` already includes the Undertow Quarkus extension.
ja_jp: アプリケーションでサーブレットを使用するには、 https://undertow.io[Undertow] のようなサーブレットコンテナーが必要です。幸い、 `pom.xml` にインポートされる `quarkus-bom` には、すでに Undertow Quarkus エクステンションが含まれています。

source: To use Servlets in your applications, you need to have a Servlet Container such as https://undertow.io[Undertow]. Luckily, `quarkus-bom` imported by our parent `pom.xml` already includes the Undertow Quarkus extension.
ja_jp: アプリケーションでサーブレットを使用するには、 https://undertow.io[Undertow] のようなサーブレット コンテナーが必要です。幸いなことに、親 `pom.xml` によってインポートされた `quarkus-bom` には、すでに Undertow Quarkus エクステンションが含まれています。

source: To use TLS with mutual authentication, use the following configuration:
ja_jp: 相互認証付きのTLSを使用するには、以下の設定を使用します。

source: To use TLS, you need to:
ja_jp: TLSを使うには、以下を実施してください:

source: To use `STARTTLS`, you need to configure the `start-tls` property to `REQUIRED` or `OPTIONAL` and set `tls` to `false`:
ja_jp: `STARTTLS` を使用するには、 `start-tls` プロパティーを `REQUIRED` または `OPTIONAL` に設定し、 `tls` を `false` に設定する必要があります。

source: To use `START_TLS`, make sure you set `tls` to `false` and `start-tls` to `REQUIRED` or `OPTIONAL`.
ja_jp: `START_TLS` を使用するには、 `tls` を `false` に、 `start-tls` を `REQUIRED` または `OPTIONAL` に設定します。

source: To use `io_uring`, refer to the <<use-io_uring>> section.
ja_jp: `io_uring` を使用するには、<<use-io_uring>> セクションを参照してください。

source: To use `io_uring`, refer to the xref:use-io_uring[Use io_uring] section.
ja_jp: `io_uring` を使用するには、 xref:use-io_uring[io_uringの使用] セクションを参照してください。

source: To use `io_uring`, you need to add two dependencies to your project and enable native transport. First add the following dependencies to your project:
ja_jp: `io_uring` を使用するには、プロジェクトに 2 つの依存関係を追加し、ネイティブトランスポートを有効にする必要があります。 まず、プロジェクトに次の依存関係を追加します。

source: To use a JDBC datasource, start by adding the necessary dependencies:
ja_jp: JDBC データソースを使用するには、必要な依存関係を追加することから始めます。

source: To use a JDBC datasource, start with adding the necessary dependencies:
ja_jp: JDBC データソースを使用するには、必要な依存関係を追加することから始めます：

source: To use a JDBC driver for another database, <<other-databases,use a database with no built-in extension or with a different driver>>.
ja_jp: 別のデータベースの JDBC ドライバーを使用するには、<<other-databases,use a database with no built-in extension or with a different driver>> 組み込みのエクステンションがないデータベース、または異なるドライバーを使用するデータベースを利用してください。

source: To use a JDBC store, the `quarkus-agroal` extension, which provides the datasource support, is also required.
ja_jp: JDBCストアを使用するには、データソースのサポートを提供する `quarkus-agroal` エクステンションも必要です。

source: To use a `MULTICAST` queue, you need to provide the _FQQN_ (fully-qualified queue name) instead of just the name of the queue:
ja_jp: `MULTICAST` キューを使用するには、キューの名前だけでなく、_FQQN_(完全修飾キュー名) を指定する必要があります。

source: To use a `p12` (PKCS12) key store, apply the following configuration:
ja_jp: `p12` (PKCS12) キーストアを使用するには、次の設定を適用します。

source: To use a custom Dockerfile instead of the pregenerated Dockerfiles, set the path to your Dockerfile:
ja_jp: 事前生成済のDockerfileの代わりにカスタムDockerfileを使用するには、Dockerfileへのパスを設定します：

source: To use a custom Dockerfile instead of the pregenerated Dockerfiles, set the path to your custom Dockerfile:
ja_jp: 事前に生成された Dockerfile の代わりにカスタム Dockerfile を使用するには、カスタム Dockerfile へのパスを設定します:

source: To use a database kind that is not built-in, use `other` and define the JDBC driver explicitly
ja_jp: ビルトインされていない種類のデータベースを使用するには、 `other` を使用し、JDBC ドライバーを明示的に定義します。

source: To use an existing queue, you need to configure the `address`, `container-id` and, optionally, the `link-name` attributes. For example, if you have an Apache Artemis broker configured with:
ja_jp: 既存のキューを使用するには、 `address`、 `container-id`、およびオプションで `link-name` 属性を設定する必要があります。たとえば、Apache Artemis ブローカーが次のように設定されている場合:

source: To use an existing queue, you need to configure the `address`, `container-id`, and, optionally, the `link-name` attributes. For example, if you have an Apache ActiveMQ Artemis broker configured with:
ja_jp: 既存のキューを使用するには、 `address` 、 `container-id` 、およびオプションで `link-name` 属性を設定する必要があります。例えば、以下のように設定された Apache ActiveMQ Artemis ブローカーがある場合:

source: To use an existing queue, you need to configure the `name` and set the exchange's or queue's `declare` property to `false`. For example, if you have a RabbitMQ broker configured with a `people` exchange and queue, you need the following configuration:
ja_jp: 既存のキューを使用するには、 `name` を設定し、エクスチェンジまたはキュー の `declare` プロパティーを `false` に設定する必要があります。たとえば、 `people` エクスチェンジとキューで設定された RabbitMQ ブローカーがある場合、次の設定が必要です。

source: To use it, add the following to your `build.gradle` file:
ja_jp: 使用するには、 `build.gradle` ファイルに以下を追加します。

source: To use it, it needs to be added as a dependency:
ja_jp: 使用するにはこれを依存関係として追加する必要があります:

source: To use it, you must add the following test dependencies in your `pom.xml`.
ja_jp: これを使用するには、 `pom.xml` に以下のテスト依存関係を追加する必要があります。

source: To use it, you must add the following test dependency in your `pom.xml`.
ja_jp: これを使うには、次のようなテストの依存関係を `pom.xml` に追加する必要があります。

source: To use logging in Quarkus scripting with JBang you do as usual, with configuring a logger, i.e.
ja_jp: jbang による Quarkus スクリプトでロギングを使用するには、通常通りロガーを設定します。

source: To use optimistic locking, you need to use a variant of the `withTransaction` method allowing execution of code before the transaction starts. In other words, it will be executed as follows:
ja_jp: 楽観的ロックを使用するには、トランザクションが開始される前にコードを実行できる `withTransaction` メソッドのバリアントを使用する必要があります。 言い換えると、以下のように実行されます。

source: To use optimistic locking, you need to use a variant of the `withTransaction` method, allowing the execution of code before the transaction starts. In other words, it will be executed as follows:
ja_jp: 楽観ロックを使用するには、 `withTransaction` メソッドのバリアントを使用する必要があり、トランザクションが始まる前にコードを実行できるようにします。つまり、以下のように実行されます。

source: To use pausable channels, you need to activate it with the configuration property `pausable` set to `true`.
ja_jp: 一時停止可能なチャネルを使用するには、設定プロパティー `pausable` を `true` に設定してアクティブ化する必要があります。

source: To use the <<jdbc-datasource,JDBC>> and <<reactive-datasource,reactive>> datasources simultaneously:
ja_jp: <<jdbc-datasource,JDBC>> および <<reactive-datasource,reactive>> データソースを同時に使用するには、以下を実行してください。

source: To use the Infinispan client extension, you need at least one running instance of Infinispan Server.
ja_jp: Infinispanクライアント・エクステンションを使用するには、少なくとも1つのInfinispan Serverの稼働しているインスタンスが必要です。

source: To use the Kubernetes Dev Service, you simply need to add the `quarkus-kubernetes-client` extension to your project:
ja_jp: Kubernetes Dev Service を使用するには、`quarkus-kubernetes-client` エクステンションをプロジェクトに追加するだけです。

source: To use the Mutiny clients, you need to add the right dependency to your project. Browse https://search.maven.org/search?q=a:smallrye-mutiny-vertx*[the list of dependency] to pick the one you need.
ja_jp: Mutinyクライアントを使用するには、適切な依存関係をプロジェクトに追加する必要があります。 https://search.maven.org/search?q=a:smallrye-mutiny-vertx*[依存関係のリスト]を見て、必要なものを選んでください。

source: To use the Oracle Database with Quarkus, in JVM mode and native mode, you can now include the following snippet in your `pom.xml`:
ja_jp: Oracle DatabaseをJVMモードおよびネイティブモードでQuarkusと一緒に使用するには、次のスニペットを `pom.xml` に含めることで可能です。

source: To use the Quarkus CLI in the next step, xref:cli-tooling.adoc#installing-the-cli[install the latest version of the Quarkus CLI]. Confirm the version number using `quarkus -v`.
ja_jp: 次のステップでQuarkus CLIを使用するには、 xref:cli-tooling.adoc#installing-the-cli[Quarkus CLIの最新バージョンをインストール] します。 `quarkus -v` を使用してバージョン番号を確認します。

source: To use the SmallRye JWT Build API, add the following dependency to your project:
ja_jp: SmallRye JWT ビルド API を使用するには、プロジェクトに次の依存関係を追加します。

source: To use the `AuthzClient` directly, set `quarkus.keycloak.policy-enforcer.enable=true`. Otherwise, no bean is available for injection.
ja_jp: `AuthzClient` を直接使用する場合は、 `quarkus.keycloak.policy-enforcer.enable=true` を設定します。 設定しない場合は、注入に Bean を使用できません。

source: To use the `AuthzClient` directly, set `quarkus.keycloak.policy-enforcer.enabled=true`. Otherwise, no bean is available for injection.
ja_jp: `AuthzClient` を直接使用するには、 `quarkus.keycloak.policy-enforcer.enabled=true` を設定します。 設定しない場合は、注入に Bean を使用できません。

source: To use the `websockets-next` extension, you need to add the `io.quarkus:quarkus-websockets-next` depencency to your project.
ja_jp: `websockets-next` エクステンションを使用するには、プロジェクトに `io.quarkus:quarkus-websockets-next` 依存関係を追加する必要があります。

source: To use the assistant in a xref:dev-ui.adoc#jsonrpc-against-the-runtime-classpath[`JsonRpcService`] on the runtime classpath, you need to make sure the `Assistant` interface is available:
ja_jp: ランタイムクラスパスの xref:dev-ui.adoc#jsonrpc-against-the-runtime-classpath[`JsonRpcService`] でアシスタントを使用するには、 `Assistant` インターフェースが利用可能であることを確認する必要があります。

source: To use the both extension simultaneously, add both extension to the `pom.xml` file:
ja_jp: 両方のエクステンションを同時に使用するには、`pom.xml` ファイルに両方のエクステンションを追加します。

source: To use the built-in sampler, you can configure it by setting the desired sampler parameters as detailed in the <<configuration-reference>>. As an example, you can configure the sampler to retain 50% of the traces:
ja_jp: 組み込みサンプラーを使用するには、<<configuration-reference>> の説明にあるように、必要なサンプラーパラメーターを設定することで、設定できます。たとえば、トレースの 50% を保持するようにサンプラーを設定できます。

source: To use the client, inject an `OpenShiftClient` instead of the `KubernetesClient`:
ja_jp: クライアントを使用するには、 `KubernetesClient` の代わりに `OpenShiftClient` を注入します。

source: To use the connector, you need to add the `quarkus-messaging-amqp` extension.
ja_jp: コネクタを使用するには、 `quarkus-messaging-amqp` エクステンションを追加する必要があります。

source: To use the connector, you need to add the `quarkus-messaging-rabbitmq` extension.
ja_jp: コネクタを使用するには、 `quarkus-messaging-rabbitmq` エクステンションを追加する必要があります。

source: To use the connector, you need to add the `quarkus-smallrye-reactive-messaging-amqp` extension.
ja_jp: コネクターを使用するには、 `quarkus-smallrye-reactive-messaging-amqp` エクステンションを追加する必要があります。

source: To use the connector, you need to add the `quarkus-smallrye-reactive-messaging-rabbitmq` extension.
ja_jp: コネクターを使用するには、 `quarkus-smallrye-reactive-messaging-rabbitmq` エクステンションを追加する必要があります。

source: To use the default behaviour which is based on implicit converter or a custom defined one add `@DefaultConverter` annotation to the configuration item
ja_jp: 暗黙のコンバータまたはカスタム定義されたコンバータに基づくデフォルトの動作を使用するには、設定項目に `@DefaultConverter` アノテーションを追加します。

source: To use the extension include it as a dependency in your build file:
ja_jp: このエクステンションを使用するには、アプリケーションの依存関係として以下をビルドファイルにインクルードしてください:

source: To use the extension, add the dependency to the target project:
ja_jp: このエクステンションを使用するには、対象プロジェクトに依存関係を追加してください。

source: To use the extension-agnostic `MetricFactory` API, your processor can define a `BuildStep` that produces a `MetricsFactoryConsumerBuildItem` that uses a `RUNTIME_INIT` or `STATIC_INIT` Recorder to define a `MetricsFactory` consumer.
ja_jp: エクステンションに依存しない `MetricFactory` API を使用するために、プロセッサーは、 `RUNTIME_INIT` または `STATIC_INIT` レコーダを使用して `MetricsFactory` コンシューマを定義する `MetricsFactoryConsumerBuildItem` を生成する `BuildStep` を定義できます。

source: To use the load shedding extension, you need to add the `io.quarkus:quarkus-load-shedding` extension to your project:
ja_jp: 負荷制限エクステンションを使用するには、プロジェクトに `io.quarkus:quarkus-load-shedding` エクステンションを追加する必要があります。

source: To use the mailer, you need to add the `quarkus-mailer` extension.
ja_jp: Mailerを使用するには、 `quarkus-mailer` エクステンションを追加する必要があります。

source: To use the new entity, update the `hello` method to start writing some data.
ja_jp: 新しいエンティティーを使用するには、 `hello` メソッドを更新してデータの書き込みを開始します。

source: To use the newly created `KeyStore`s, add the following configuration to `application.properties`:
ja_jp: 新しく作成した `KeyStore` を使用するには、以下の設定を `application.properties` に追加します:

source: To use the refresh token, you should carefully configure the session cookie age. The session age should be longer than the ID token lifespan and close to or equal to the refresh token lifespan.
ja_jp: リフレッシュトークンを使用するには、セッションクッキーの有効期間を慎重に設定する必要があります。 セッションの有効期間は、ID トークンの有効期間よりも長く、リフレッシュトークンの有効期間と近いか等しい必要があります。

source: To use the telemetry features, add the OpenTelemetry extras to your project:
ja_jp: テレメトリー機能を使用するには、プロジェクトに OpenTelemetry エクストラを追加します。

source: To use the typesafe client, we need the corresponding model classes that are compatible with the schema. There are two ways to obtain them. First is to use the client generator offered by SmallRye GraphQL, which generates classes from the schema document and a list of queries. This generator is considered highly experimental for now, and is not covered in this example. If interested, refer to the https://github.com/smallrye/smallrye-graphql/tree/main/client/generator[Client Generator] and its documentation.
ja_jp: タイプセーフ・クライアントを使うには，スキーマと互換性のある対応するモデルクラスが必要です．それらを入手するには2つの方法があります。1つ目は、SmallRye GraphQLが提供するクライアントジェネレータを使用する方法で、これはスキーマドキュメントとクエリのリストからクラスを生成します。このジェネレーターは今のところ非常に実験的なものとされており、この例では取り上げていません。興味のある方は、 link:https://github.com/smallrye/smallrye-graphql/tree/main/client/generator[Client Generator]とそのドキュメントを参照してください。

source: To use them with MongoDB with Panache you need to annotate the method that starts the transaction with the `@Transactional` annotation.
ja_jp: MongoDB with Panacheでこれらを使うには、トランザクションを開始するメソッドに `@Transactional` アノテーションを付ける必要があります。

source: To use them with reactive entities or repositories you need to use `io.quarkus.mongodb.panache.common.reactive.Panache.withTransaction()`.
ja_jp: これらをリアクティブエンティティーまたはリポジトリーで使用するには、 `io.quarkus.mongodb.panache.common.reactive.Panache.withTransaction()` を使用する必要があります。

source: To use them, you need to add the `io.quarkus:quarkus-test-infinispan-client` dependency to your pom.xml.
ja_jp: これらを使用するには、 `io.quarkus:quarkus-test-infinispan-client` の依存関係を pom.xml に追加する必要があります。

source: To use them, you need to add the `io.quarkus:quarkus-test-mongodb` dependency to your pom.xml.
ja_jp: これらを使用するには、 `io.quarkus:quarkus-test-mongodb` の依存関係を pom.xml に追加する必要があります。

source: To use these expert options, add them comma separated to the `-Dquarkus.native.additional-build-args` parameter.
ja_jp: これらのエキスパートオプションを使用するには、 `-Dquarkus.native.additional-build-args` パラメータにコンマで区切って追加します。

source: To use this authentication method, you must first enable SSL/TLS for your application. For more information, see the xref:http-reference.adoc#ssl[Supporting secure connections with SSL/TLS] section of the Quarkus "HTTP reference" guide.
ja_jp: この認証方法を使用するには、まずアプリケーションで SSL/TLS を有効にする必要があります。 詳細は、Quarkus ガイド "HTTP リファレンス" の xref:http-reference.adoc#ssl[Supporting secure connections with SSL/TLS] を参照してください。

source: To use this authentication method, you should first enable SSL for your application. For more details, check the xref:http-reference.adoc#ssl[Supporting secure connections with SSL] guide.
ja_jp: この認証方法を使用するには、まずアプリケーションでSSLを有効にする必要があります。詳しくは、 link:http-reference.html#ssl[「Supporting secure connections with SSL]」をご覧ください。

source: To use this base image, use the following `Dockerfile`:
ja_jp: このベースイメージを使用するには、以下の `Dockerfile` を使用します:

source: To use this extension, make sure you have the loom-unit extension in your project:
ja_jp: このエクステンションを使用するには、プロジェクトにloom-unitエクステンションがあることを確認してください：

source: To use this extension, the user must be familiar with Redis, especially understanding the mechanism of commands and how they are organized. Typically, we recommend:
ja_jp: このエクステンションを使うには、ユーザーが Redis に精通していること、特にコマンドの仕組みとその設定について理解していることが必要です。一般的には、以下を推奨します。

source: To use this failure handler, the bean must be exposed with the `@Identifier` qualifier and the connector configuration must specify the attribute `mp.messaging.incoming.$channel.[key|value]-deserialization-failure-handler` (for key or value deserializers).
ja_jp: このエラーハンドラーを使用するには、Bean を `@Identifier` 修飾子で公開し、コネクター設定で属性 `mp.messaging.incoming.$channel.[key|value]-deserialization-failure-handler` を指定する必要があります (キーまたは値のデシリアライザー用)。

source: To use this failure handler, the bean must be exposed with the `@Identifier` qualifier and the connector configuration must specify the attribute `mp.messaging.outgoing.$channel.[key|value]-serialization-failure-handler` (for key or value serializers).
ja_jp: このエラーハンドラーを使用するには、Bean を `@Identifier` 修飾子で公開し、コネクター設定で属性 `mp.messaging.outgoing.$channel.[key|value]-serialization-failure-handler` を指定する必要があります (キーまたは値のデシリアライザー用)。

source: To use this feature simply open the Dev UI when the `quarkus-flyway` extension is installed and click in the `Datasources` link in the Flyway pane. Hit the `Create Initial Migration` button and the following will happen:
ja_jp: この機能を使用するには、 `quarkus-flyway` エクステンションがインストールされている状態で Dev UI を開き、Flyway ペインの `Datasources` リンクをクリックします。 `Create Initial Migration` ボタンを押すと、以下が実行されます。

source: To use this feature, add the following dependency to your project:
ja_jp: この機能を使用するには、プロジェクトに以下の依存関係を追加します。

source: To use this feature, add the following extension to your project.
ja_jp: この機能を使用するには、以下のエクステンションをプロジェクトに追加します。

source: To use this feature, add the following extension to your project:
ja_jp: この機能を使用するには、以下のエクステンションをプロジェクトに追加します。

source: To use this feature, ensure a Docker or Podman container runtime is installed, depending on the database type. Certain databases, such as H2, operate in in-memory mode and do not require a container runtime.
ja_jp: この機能を使用するには、データベースの種類に応じて、DockerまたはPodmanコンテナランタイムがインストールされているようにして下さい。H2などの一部のデータベースはインメモリモードで動作するため、コンテナランタイムは必要ありません。

source: To use this feature, make sure:
ja_jp: この機能を使うには以下が必要です:

source: To use this feature, run:
ja_jp: この機能を使用するには、以下を実行します。

source: To use this feature, you have to add a dependency on `quarkus-test-kubernetes-client`:
ja_jp: この機能を使うには、 `quarkus-test-kubernetes-client` への依存関係を追加する必要があります：

source: To use this feature, you have to add a dependency on `quarkus-test-openshift-client`:
ja_jp: この機能を使用するには、 `quarkus-test-openshift-client` に依存関係を追加する必要があります。

source: To use this new client, have a look at the updated link:/guides/elasticsearch[Elasticsearch guide].
ja_jp: この新しいクライアントを使用するには、更新された link:/guides/elasticsearch[Elasticsearchのガイド] をご覧ください。

source: To use this simply override the bean you wish to mock with a class in the `src/test/java` directory, and put the `@Alternative` and `@Priority(1)` annotations on the bean. Alternatively, a convenient `io.quarkus.test.Mock` stereotype annotation could be used. This built-in stereotype declares `@Alternative`, `@Priority(1)` and `@Dependent`. For example if I have the following service:
ja_jp: これを使用するには、 `src/test/java` ディレクトリーのクラスでモックしたいBeanをオーバーライドし、 `@Alternative` と `@Priority(1)` アノテーションをBeanに配置するだけです。あるいは、便利な `io.quarkus.test.Mock` ステレオタイプアノテーションを使用することもできます。この組み込みステレオタイプは、 `@Alternative`、 `@Priority(1)`、 `@Dependent` を宣言します。例えば、以下のようなサービスがあるとします:

source: To use this state in your page:
ja_jp: ページでこの状態を使用するには:

source: To use this with a programmatically created GraphQL client, both builders, `VertxDynamicGraphQLClientBuilder` and `VertxTypesafeGraphQLClientBuilder`, contain a `dynamicHeader(String, Uni<String>)` method that lets you plug in a header that might change for every request.
ja_jp: プログラムで作成された GraphQL クライアントでこれを使用するには、`VertxDynamicGraphQLClientBuilder` と `VertxTypesafeGraphQLClientBuilder` の両方のビルダーに `dynamicHeader(String, Uni<String>)` メソッドがあり、すべてのリクエストで変更される可能性のあるヘッダーをプラグインできます。

source: To use tracing with MongoDB, you need to add the xref:opentelemetry.adoc[`quarkus-opentelemetry`] extension to your project.
ja_jp: MongoDB でトレースを使用するには、プロジェクトに xref:opentelemetry.adoc[`quarkus-opentelemetry`] エクステンションを追加する必要があります。

source: To use tracing with a datasource, you need to add the xref:opentelemetry-tracing.adoc[`quarkus-opentelemetry`] extension to your project.
ja_jp: データソースでトレースを使用するには、プロジェクトに xref:opentelemetry-tracing.adoc[`quarkus-opentelemetry`] エクステンションを追加する必要があります。

source: To use tracing with a datasource, you need to add the xref:opentelemetry.adoc[`quarkus-opentelemetry`] extension to your project.
ja_jp: データソースでトレースを使用するには、プロジェクトに xref:opentelemetry.adoc[`quarkus-opentelemetry`] エクステンションを追加する必要があります。
